ubinos/ArduinoCore-API_wrapper/include/arch/arm/cortexm/nrf52840dongle/pins_arduino_digital.h
/*
 * Copyright (c) 2021 Sung Ho Park and CSOS
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef PINS_ARDUINO_DIGITAL_H_
#define PINS_ARDUINO_DIGITAL_H_

#include "variant.h"

enum {
    D0,  D1,  D2,  D3,  D4,  D5,  D6,  D7,
    D8,  D9, D10, D11, D12, D13,
    NUM_DIGITAL_PINS
};

#endif /* PINS_ARDUINO_DIGITAL_H_ */

